/*Задача 5:
В какъв ред ще се изпълни операторът запетая , ?*/
#include <stdio.h>

int main(void){
    int x = 1, y = 0; // ляво -> надясно записва се променлива а и се дава стойност, след това y 
    int z = y || x;
    printf("\nInit values: X= %d, Y= %d\n", x, y);
    x = 1 + 2, 2 * 3, 3 + 4;// първо се изпълнява 3+4, 
                            // изтрива се, после се изпълнява 2*3, 
                            // изтрива се, после се изпълнява 1 + 2 и стойността се присвоява
    y = ( 7 * 8, 8 + 9, 9 - 4);//първо се изпълнява 7*8
                            // изтрива се, после 8 + 9
                            // изтрива се и се взима стойността на 9 - 4 и се записва 
    printf("\nX= %d, Y= %d\n", x, y); 

    return 0;
}