/*Задача 4:
В какъв ред ще се изпълнят операциите?
true = x&&y&x<<1;
Какво ще се принтира на екрана?
В какъв ред ще се изпълнят операциите?
true = x&&y^x<<1;
Какво ще се принтира на екрана?
*/
#include <stdio.h>

int main(void){
    int x = 10;
    int y = 10;
    int true;
    int false;
    
    false = x && y & x << 1; // първо се извършва преместването на битове на ляво
                             // после се извършва побитовата операция
                             // след това логичското И
                             // и накрая присвояването
    printf("%d\n", false);

    true = x && y ^ x << 1; // първо се извършва преместването на битове
                            // после побитово изключващо ИЛИ
                            // след това логическото И
                            //накрая се извършва присвояване
    printf("%d\n", true);

    return 0;
}