/*Първата функция strcpy(s, t), която копира низа t в низа s. Щеше да е
чудесно просто да кажем s = t, но по този начин ще копираме указателите, а
не всички символи от единия в другия масив. За да стане това трябва да
обходим целия масив символ по символ и като използваме цикъл и да
присвоим стойността всеки един елемент от единия масив на същата
позиция в другия.
Задача 3.Опитайте да го направите сами:*/
#include <stdio.h>

void our_strcpy(char *s, char *t);

int main(void) {
    char s[] = {"Programming"};
    char t[20];

    our_strcpy(s, t);

    return 0;
}

void our_strcpy(char *s, char *t) {
    int i = 0;
    while (s[i] != '\0') {
        t[i] = s[i];
        i++;
    }
    printf("%s", t);
    return;
}