/*Задача 5*. Напишете програма, която генерира “случайна разходка” из
елементите на двумерен масив от тип char с размер 10 х 10. Преди разходката
всички елементи на масива съдържат символа ‘.’ и след като елемента е
посетен в него се записва поредната буква от латинската азбука т.е. на първия
посетен елемент се записва буквата ‘А’, а нз последния буквата ‘Z’. Програмата
трябва да се разхожда от елемент на елемент в следната последователност:
от елемента, на който е в момента може да се премести един елемент на горе,
на долу, на ляво или на дясно. Не може да се премества на произволна
позиция. Преди всяко преместване проверете дали няма да излезете извън
масива и дали позицията вече не е заета от някоя буква т.е. елемента да е
посетен вече. Ако горните условия са изпълнени се преместете в желатана
посока. Ако всичките 4 дестинации са блокирани вашата програм трябва да
спре.
Подсказка: Използвайте функциите srand() и rand() за да генерирате случайните числа. 
Използвайте int n = rand() % 4; за да генерирате числа от 1 до 4*/
#include <stdio.h>
#include <stdlib.h>

void arrManipulation(char arr[10][10], char a[]);
void makeAlphabetArray(char arr[]);

int main(void) {
    char arr[10][10];
    char abcArr[26];

    for(int i = 0; i < 10; i++){
        for(int j = 0; j < 10; j++){
            arr[i][j] = '.';
        }
    }
    
    makeAlphabetArray(abcArr);
    arrManipulation(arr, abcArr);

    for(int i = 0; i < 10; i++){
        for(int j = 0; j < 10; j++){
            printf("%c", arr[i][j]);
        }
        printf("\n");
    }

    return 0;
}

void makeAlphabetArray(char arr[]){
    int size = 26;
    for(int i = 0; i < size; i++) 
        arr[i] = (char)(97 + i);

    return;
}

void arrManipulation(char arr[10][10], char a[]){
    int n = rand();
    int i = 0;
    if(arr[n][n] == '.')
        arr[n][n] == 'a';

    return;
}